Backend/load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 30
      arrivalRate: 10
  http:
    timeout: 10

scenarios:
  - name: "Test local API"
    flow:
      - post:
          url: "/api/auth/login"
          headers:
            Content-Type: "application/json"
          json:
            username: "testuser"
            password: "testpassword"